wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_trigsel.c
      \arg        TRIGSEL_INPUT_HRTIMER_ST6_CH1: trigger input source HRTIMER slave6 CH1
      \arg        TRIGSEL_INPUT_HRTIMER_ST7_CH0: trigger input source HRTIMER slave7 CH0
      \arg        TRIGSEL_INPUT_HRTIMER_ST7_CH1: trigger input source HRTIMER slave7 CH1
      \arg        TRIGSEL_INPUT_ADC0_CONV: trigger input source ADC0 CONV
      \arg        TRIGSEL_INPUT_ADC1_CONV: trigger input source ADC1 CONV
      \arg        TRIGSEL_INPUT_ADC2_CONV: trigger input source ADC2 CONV
      \arg        TRIGSEL_INPUT_ADC3_CONV: trigger input source ADC3 CONV
      \arg        TRIGSEL_INPUT_LCKM_OUT: trigger input source LCKM_OUT
    \param[out] none
    \retval     none
*/
void trigsel_init(trigsel_periph_enum target_periph, trigsel_source_enum trigger_source)
{
    uint32_t reg;
    
    /* if register write is enabled, set trigger source to target peripheral */
    if (RESET == trigsel_register_lock_get(target_periph)){
        reg = TRIGSEL_TARGET_REG(target_periph);
        reg &= ~TRIGSEL_TARGET_PERIPH_MASK(target_periph);
        reg |= ((uint32_t)trigger_source << TRIGSEL_TARGET_PERIPH_SHIFT(target_periph)) & TRIGSEL_TARGET_PERIPH_MASK(target_periph);
        TRIGSEL_TARGET_REG(target_periph) = reg;
    }
}

/*!
    \brief      get the trigger input signal for target peripheral
    \param[in]  target_periph: target peripheral value
                only one parameter can be selected which is shown as below:
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT0: output target peripheral TRIGSEL_OUT0 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT1: output target peripheral TRIGSEL_OUT1 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT2: output target peripheral TRIGSEL_OUT2 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT3: output target peripheral TRIGSEL_OUT3 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT4: output target peripheral TRIGSEL_OUT4 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT5: output target peripheral TRIGSEL_OUT5 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT6: output target peripheral TRIGSEL_OUT6 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT7: output target peripheral TRIGSEL_OUT7 pin
      \arg        TRIGSEL_OUTPUT_ADC0_ROUTRG: output target peripheral ADC0_ROUTRG
      \arg        TRIGSEL_OUTPUT_ADC0_INSTRG: output target peripheral ADC0_INSTRG
      \arg        TRIGSEL_OUTPUT_ADC1_ROUTRG: output target peripheral ADC1_ROUTRG
      \arg        TRIGSEL_OUTPUT_ADC1_INSTRG: output target peripheral ADC1_INSTRG
      \arg        TRIGSEL_OUTPUT_ADC2_ROUTRG: output target peripheral ADC2_ROUTRG
      \arg        TRIGSEL_OUTPUT_ADC2_INSTRG: output target peripheral ADC2_INSTRG
      \arg        TRIGSEL_OUTPUT_ADC3_ROUTRG: output target peripheral ADC3_ROUTRG
      \arg        TRIGSEL_OUTPUT_ADC3_INSTRG: output target peripheral ADC3_INSTRG
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN0: output target peripheral TIMER0_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN1: output target peripheral TIMER0_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN2: output target peripheral TIMER0_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN0: output target peripheral TIMER7_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN1: output target peripheral TIMER7_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN2: output target peripheral TIMER7_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER14_BRKIN0: output target peripheral TIMER14_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER15_BRKIN0: output target peripheral TIMER15_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER16_BRKIN0: output target peripheral TIMER16_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN0: output target peripheral TIMER19_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN1: output target peripheral TIMER19_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN2: output target peripheral TIMER19_BRKIN2
      \arg        TRIGSEL_OUTPUT_CAN0_EX_TIME_TICK: output target peripheral CAN0_EX_TIME_TICK 
      \arg        TRIGSEL_OUTPUT_CAN1_EX_TIME_TICK: output target peripheral CAN1_EX_TIME_TICK 
      \arg        TRIGSEL_OUTPUT_CAN2_EX_TIME_TICK: output target peripheral CAN2_EX_TIME_TICK 
      \arg        TRIGSEL_OUTPUT_TIMER0_ETI: output target peripheral TIMER0_ETI
      \arg        TRIGSEL_OUTPUT_TIMER1_ETI: output target peripheral TIMER1_ETI
      \arg        TRIGSEL_OUTPUT_TIMER2_ETI: output target peripheral TIMER2_ETI
      \arg        TRIGSEL_OUTPUT_TIMER3_ETI: output target peripheral TIMER3_ETI
      \arg        TRIGSEL_OUTPUT_TIMER4_ETI: output target peripheral TIMER4_ETI
      \arg        TRIGSEL_OUTPUT_TIMER7_ETI: output target peripheral TIMER7_ETI
      \arg        TRIGSEL_OUTPUT_TIMER19_ETI: output target peripheral TIMER19_ETI
      \arg        TRIGSEL_OUTPUT_HPDF_ITRG: output target peripheral HPDF_ITRG
      \arg        TRIGSEL_OUTPUT_TIMER0_ITI14: output target peripheral TIMER0_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER1_ITI14: output target peripheral TIMER1_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER2_ITI14: output target peripheral TIMER2_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER3_ITI14: output target peripheral TIMER3_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER4_ITI14: output target peripheral TIMER4_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER7_ITI14: output target peripheral TIMER7_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER14_ITI14: output target peripheral TIMER14_ITI14
      \arg        TRIGSEL_OUTPUT_TIMER19_ITI14: output target peripheral TIMER19_ITI14
      \arg        TRIGSEL_OUTPUT_DAC0_EXTRIG0: output target peripheral DAC0_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC0_EXTRIG1: output target peripheral DAC0_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC1_EXTRIG0: output target peripheral DAC1_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC1_EXTRIG1: output target peripheral DAC1_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC2_EXTRIG0: output target peripheral DAC2_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC2_EXTRIG1: output target peripheral DAC2_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC3_EXTRIG0: output target peripheral DAC3_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC3_EXTRIG1: output target peripheral DAC3_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC0_ST_EXTRIG0: output target peripheral DAC0_ST_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC0_ST_EXTRIG1: output target peripheral DAC0_ST_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC1_ST_EXTRIG0: output target peripheral DAC1_ST_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC1_ST_EXTRIG1: output target peripheral DAC1_ST_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC2_ST_EXTRIG0: output target peripheral DAC2_ST_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC2_ST_EXTRIG1: output target peripheral DAC2_ST_EXTRIG1
      \arg        TRIGSEL_OUTPUT_DAC3_ST_EXTRIG0: output target peripheral DAC3_ST_EXTRIG0
      \arg        TRIGSEL_OUTPUT_DAC3_ST_EXTRIG1: output target peripheral DAC3_ST_EXTRIG1
      \arg        TRIGSEL_OUTPUT_CLA_IN0: output target peripheral CLA_IN0
      \arg        TRIGSEL_OUTPUT_CLA_IN1: output target peripheral CLA_IN1
      \arg        TRIGSEL_OUTPUT_CLA_IN2: output target peripheral CLA_IN2
      \arg        TRIGSEL_OUTPUT_CLA_IN3: output target peripheral CLA_IN3
      \arg        TRIGSEL_OUTPUT_CLA_IN4: output target peripheral CLA_IN4
      \arg        TRIGSEL_OUTPUT_CLA_IN5: output target peripheral CLA_IN5
      \arg        TRIGSEL_OUTPUT_CLA_IN6: output target peripheral CLA_IN6
      \arg        TRIGSEL_OUTPUT_CLA_IN7: output target peripheral CLA_IN7
      \arg        TRIGSEL_OUTPUT_CLA_IN8: output target peripheral CLA_IN8
      \arg        TRIGSEL_OUTPUT_CLA_IN9: output target peripheral CLA_IN9
      \arg        TRIGSEL_OUTPUT_CLA_IN10: output target peripheral CLA_IN10
      \arg        TRIGSEL_OUTPUT_CLA_IN11: output target peripheral CLA_IN11
    \param[out] none
    \retval  trigger_source: trigger source value(0~186)
*/
trigsel_source_enum trigsel_trigger_source_get(trigsel_periph_enum target_periph)
{
    trigsel_source_enum trigger_source;

    trigger_source = (trigsel_source_enum)((TRIGSEL_TARGET_REG(target_periph) & TRIGSEL_TARGET_PERIPH_MASK(target_periph)) >> TRIGSEL_TARGET_PERIPH_SHIFT(target_periph));

